'''
Напишите программу, которая считывает 3 строки с именами одним вызовом функции 
input() и выводит их в обратном порядке.

Sample Input 1:
Вася
Петя
Толя

Sample Output 1:
Толя
Петя
Вася
'''
s = str(input("введите имя:"))
d = str(input("введите имя:"))
f = str(input("введите имя:"))
print(f)
print(d)
print(s)